InformationRegisters/КР_ГрафикОтгрузкиИПриемкиТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ГрафикОтгрузкиИПриемкиТМЦ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузоперевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КР_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимРазгрузкиНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимРазгрузкиОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньРазгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДнейВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПРР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЛифтов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаршрутОбратно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КР_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньВозвратаНаСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоДнейВозвратаНаСклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КР_ВидыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧастотаОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервойОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереброскаНаОбратномМаршруте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПорядокПоПутиСледования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыключенаЗаписьГрафика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнутренняяЛогистика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ГрафикОтгрузкиИПриемкиТМЦ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//////////////////////////////////////////////////////////////
//// Модуль формы записи регистра сведений "КР_ГрафикОтгрузкиИПриемкиТМЦ"
//// Создан: 19.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-880
//// Разработка по ФДР С21.015, Разработка НСИ для внутренней логистики

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДнейВПутиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДеньОтгрузки) Тогда
		ЗаполнитьДеньРазгрузки();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ДеньРазгрузки)
		И Не ЗначениеЗаполнено(Запись.ДеньОтгрузки) Тогда
		ЗаполнитьДеньОтгрузки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньОтгрузкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДнейВПути) Тогда
		ЗаполнитьДеньРазгрузки();
	КонецЕсли;
	
	// Прим. разработчика
	// По требованию заказчика расчет временно отключен
	//Если ЗначениеЗаполнено(Запись.КоличествоДнейВозвратаНаСклад) Тогда
	//	ЗаполнитьДеньВозвратаНаСклад();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньРазгрузкиПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДнейВПути) Тогда
		ЗаполнитьДеньОтгрузки();
		
		// Прим. разработчика
		// По требованию заказчика расчет временно отключен
		//Если ЗначениеЗаполнено(Запись.КоличествоДнейВозвратаНаСклад) Тогда
		//	ЗаполнитьДеньВозвратаНаСклад();
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейВозвратаНаСкладПриИзменении(Элемент)
	
	// Прим. разработчика
	// По требованию заказчика расчет временно отключен
	//Если ЗначениеЗаполнено(Запись.ДеньОтгрузки) Тогда
	//	ЗаполнитьДеньВозвратаНаСклад();
	//КонецЕсли;
	
	// Прим. разработчика
	// По требованию заказчика расчет временно отключен
	//Если ЗначениеЗаполнено(Запись.ДеньВозвратаНаСклад)
	//	И Не ЗначениеЗаполнено(Запись.ДеньОтгрузки) Тогда
	//	ЗаполнитьДеньОтгрузкиПоВозвратуНаСклад();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньВозвратаНаСкладПриИзменении(Элемент)
	
	// Прим. разработчика
	// По требованию заказчика расчет временно отключен
	//Если ЗначениеЗаполнено(Запись.КоличествоДнейВозвратаНаСклад) Тогда
	//	ЗаполнитьДеньОтгрузкиПоВозвратуНаСклад();
	//	
	//	Если ЗначениеЗаполнено(Запись.ДнейВПути) Тогда
	//		ЗаполнитьДеньРазгрузки();
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньОтгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньРазгрузкиОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньВозвратаНаСкладОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьДеньРазгрузки()
	
	ДеньРазгрузки = (Запись.ДнейВПути + Запись.ДеньОтгрузки - 1) % 7;
	
	Запись.ДеньРазгрузки = ?(ДеньРазгрузки = 0, 7, ДеньРазгрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеньВозвратаНаСклад()
	
	ДеньВозвратаНаСклад = (Запись.КоличествоДнейВозвратаНаСклад + Запись.ДеньОтгрузки - 1) % 7;
	
	Запись.ДеньВозвратаНаСклад = ?(ДеньВозвратаНаСклад = 0, 7, ДеньВозвратаНаСклад);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеньОтгрузки()
	
	ДеньОтгрузки = 0;
	Множитель = 0;
	Пока ДеньОтгрузки < 1 Цикл
		ДеньОтгрузки = Запись.ДеньРазгрузки - Запись.ДнейВПути + 1 + 7 * Множитель;
		Множитель = Множитель + 1;
	КонецЦикла;
	
	Запись.ДеньОтгрузки = ДеньОтгрузки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеньОтгрузкиПоВозвратуНаСклад()
	
	ДеньОтгрузки = 0;
	Множитель = 0;
	Пока ДеньОтгрузки < 1 Цикл
		ДеньОтгрузки = Запись.ДеньВозвратаНаСклад - Запись.КоличествоДнейВозвратаНаСклад + 1 + 7 * Множитель;
		Множитель = Множитель + 1;
	КонецЦикла;
	
	Запись.ДеньОтгрузки = ДеньОтгрузки;
	
КонецПроцедуры

#КонецОбласти
